

export const useRoleModulesData = () => {

    const ruleModulesData =[
  {
    module: "الصفحة الرئيسية",
    permissions: ["عرض الصفحة الرئيسية", "عرض المعلومات المالية"],
  },
  {
    module: "الملف الشخصي",
    permissions: ["عرض الملف الشخصي", "تعديل الملف الشخصي"],
  },
  {
    module: "إدارة القضايا",
    permissions: ["رؤية القضايا", "إضافة قضية", "تعديل قضية", "عرض تفاصيل القضية", "تحليل القضية", "حذف قضية", "المرافعة"],
  },
  {
    module: "إدارة الموكلين",
    permissions: ["رؤية الموكلين", "إضافة موكل", "تعديل موكل", "رؤية تفاصيل الموكل", "حذف موكل"],
  },
  {
    module: "الإعدادات",
    permissions: ["رؤية صفحة الإعدادات", "إعدادات المكتب", "إدارة الصلاحيات"],
  },
  {
    module: "إدارة المستخدمين",
    permissions: ["رؤية المستخدمين", "إضافة مستخدم", "تعديل مستخدم", "حذف مستخدم"],
  },
  { module: "إدارة المحاكم", permissions: ["رؤية المحاكم", "إضافة محكمة", "تعديل محكمة", "حذف محكمة"] },
  { module: "إدارة الحالات", permissions: ["رؤية الحالات", "إضافة حالة", "تعديل حالة", "حذف حالة"] },
  { module: "أنواع القضايا", permissions: ["رؤية أنواع القضايا", "إضافة نوع قضية", "تعديل نوع قضية", "حذف نوع قضية"] },
  { module: "إدارة الجلسات", permissions: ["رؤية الجلسات", "إضافة جلسة", "تعديل جلسة", "حذف جلسة", "رؤية تبويب الجلسات", "أنواع الجلسات"] },
  { module: "تعيين الموظفين ", permissions: ["رؤية تبويب التعيين", "تعيين موظف", "تعديل تعيين موظف", "حذف تعيين موظف"] },
  { module: "إدارة المدفوعات", permissions: ["إدارة المدفوعات", "تعديل مدفوعات", "إضافة مدفوعات جديده", "حذف مدفوعات"] },
  { module: "إدارة المصروفات", permissions: ["رؤية المصروفات وأنواع المصروفات", "تعديل أنواع المصروفات", "إضافة نوع المصروفات", "حذف نوع المصروفات", "إدارة أنواع المصروفات", "إضافة مصروفات ", "حذف مصروفات", "تعديل مصروفات"] },
  { module: "إدارة الوثائق", permissions: ["رؤية الوثائق", "إضافة وثائق", "تعديل وثائق", "حذف وثائق", "إدارة وثائق", "تحميل وثائق"] },
  { module: "التقارير", permissions: ["تقارير الموكلين", "تقارير المستخدمين", "تقارير القضايا", "تقارير الجلسات", "تقارير المدفوعات", "تقارير المصروفات"] },
  { module: "حقول القضية", permissions: ["إدارة حقول القضية"] },
  { module: "رؤية الرول", permissions: ["رؤية الرول"] },
  { module: "التقويم", permissions: [" التقويم"] },
];


return {ruleModulesData};
}